# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [4]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd

conn = sqlite3.connect('data/data2.sqlite')

In [6]:
# Your code here; create the connection
conn = sqlite3.connect('data/data2.sqlite')

## Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [10]:
# Your code here
q1 = """
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
WHERE customerNumber IN (
    SELECT customerNumber
    FROM orders
    WHERE orderDate = '2003-01-31'
)
;
"""
q1_result = pd.read_sql(q1, conn)
q1_result

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [14]:
# Your code here
q1 = """
SELECT
    productName,
    SUM(quantityOrdered) AS totalItemsSold
FROM
    orderdetails
    JOIN products ON orderdetails.productCode = products.productCode
GROUP BY
    productName
ORDER BY
    totalItemsSold
;
"""
q1_result = pd.read_sql(q1, conn)
q1_result

                                 productName  totalItemsSold
0                      1957 Ford Thunderbird             767
1                 1970 Chevy Chevelle SS 454             803
2           1936 Mercedes Benz 500k Roadster             824
3                         1911 Ford Town Car             832
4               1999 Indy 500 Monte Carlo SS             855
..                                       ...             ...
104             1930 Buick Marquette Phaeton            1074
105  1941 Chevrolet Special Deluxe Cabriolet            1076
106                American Airlines: MD-11S            1085
107                     1937 Lincoln Berline            1111
108              1992 Ferrari 360 Spider red            1808

[109 rows x 2 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [15]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT
q1 = """
SELECT
    products.productName,
    COUNT(DISTINCT orders.customerNumber) AS totalCustomers
FROM
    orderdetails
    JOIN products ON orderdetails.productCode = products.productCode
    JOIN orders ON orderdetails.orderNumber = orders.orderNumber
GROUP BY
    products.productName
ORDER BY
    totalCustomers
;
"""
q1_result = pd.read_sql(q1, conn)
q1_result

                             productName  totalCustomers
0                     1949 Jaguar XK 120              18
1                      1952 Citroen-15CV              18
2              1969 Chevrolet Camaro Z28              18
3                    2002 Chevy Corvette              18
4    1958 Chevy Corvette Limited Edition              19
..                                   ...             ...
104                   1934 Ford V8 Coupe              27
105             1952 Alpine Renault 1300              27
106                  1972 Alfa Romeo GTA              27
107                     Boeing X-32A JSF              27
108          1992 Ferrari 360 Spider red              40

[109 rows x 2 columns]

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [21]:
# Your code here
q1 = """
SELECT DISTINCT employees.employeeNumber, employees.firstName, employees.lastName, offices.city, employees.officeCode
FROM employees
    JOIN offices ON employees.officeCode = offices.officeCode
    JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
    JOIN orders ON customers.customerNumber = orders.customerNumber
    JOIN orderdetails ON orders.orderNumber = orderdetails.orderNumber
    JOIN products ON orderdetails.productCode = products.productCode
WHERE
    products.productCode IN (
        SELECT
            productCode
        FROM
            orderdetails
            JOIN products ON orderdetails.productCode = products.productCode
            JOIN orders ON orderdetails.orderNumber = orders.orderNumber
        GROUP BY
            productCode
        HAVING
            COUNT(DISTINCT customerNumber) < 20)
;
"""
q1_result = pd.read_sql(q1, conn)
q1_result

DatabaseError: Execution failed on sql '
SELECT DISTINCT employees.employeeNumber, employees.firstName, employees.lastName, offices.city, employees.officeCode
FROM employees
    JOIN offices ON employees.officeCode = offices.officeCode
    JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
    JOIN orders ON customers.customerNumber = orders.customerNumber
    JOIN orderdetails ON orders.orderNumber = orderdetails.orderNumber
    JOIN products ON orderdetails.productCode = products.productCode
WHERE
    products.productCode IN (
        SELECT
            productCode
        FROM
            orderdetails
            JOIN products ON orderdetails.productCode = products.productCode
            JOIN orders ON orderdetails.orderNumber = orders.orderNumber
        GROUP BY
            productCode
        HAVING
            COUNT(DISTINCT customerNumber) < 20)
;
': ambiguous column name: productCode

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [22]:
# Your code here
q1 = """
SELECT
    employees.employeeNumber,
    employees.firstName,
    employees.lastName,
    COUNT(customers.customerNumber) AS numCustomers
FROM
    employees
    JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
GROUP BY
    employees.employeeNumber
HAVING
    AVG(customers.creditLimit) > 15000
;
"""
q1_result = pd.read_sql(q1, conn)
q1_result

    employeeNumber firstName   lastName  numCustomers
0             1165    Leslie   Jennings             6
1             1166    Leslie   Thompson             6
2             1188     Julie   Firrelli             6
3             1216     Steve  Patterson             6
4             1286  Foon Yue      Tseng             7
5             1323    George     Vanauf             8
6             1337      Loui     Bondur             6
7             1370    Gerard  Hernandez             7
8             1401    Pamela   Castillo            10
9             1501     Larry       Bott             8
10            1504     Barry      Jones             9
11            1611      Andy     Fixter             5
12            1612     Peter      Marsh             5
13            1621      Mami      Nishi             5
14            1702    Martin     Gerard             6

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!